PinguinoIDE/pinguino-compilers/windows64/p8/share/gputils/header/p16f18325.inc
;==========================================================================
;
;       Configuration Bits
;
;   NAME            Address
;   CONFIG1           8007h
;   CONFIG2           8008h
;   CONFIG3           8009h
;   CONFIG4           800Ah
;
;==========================================================================

; The following is an assignment of address values for all of the
; configuration registers for the purpose of table reads
_CONFIG1        EQU  H'8007'
_CONFIG2        EQU  H'8008'
_CONFIG3        EQU  H'8009'
_CONFIG4        EQU  H'800A'

;----- CONFIG1 Options --------------------------------------------------
_FEXTOSC_LP          EQU  H'3FF8'; LP (crystal oscillator) optimized for 32.768 kHz
_FEXTOSC_XT          EQU  H'3FF9'; XT (crystal oscillator) from 100 kHz to 4 MHz
_FEXTOSC_HS          EQU  H'3FFA'; HS (crystal oscillator) above 4 MHz
_FEXTOSC_OFF         EQU  H'3FFC'; Oscillator not enabled
_FEXTOSC_ECL         EQU  H'3FFD'; EC (external clock) below 100 kHz
_FEXTOSC_ECM         EQU  H'3FFE'; EC (external clock) for 100 kHz to 8 MHz
_FEXTOSC_ECH         EQU  H'3FFF'; EC (external clock) above 8 MHz

_RSTOSC_HFINT32      EQU  H'3F8F'; HFINTOSC with 2x PLL (32MHz)
_RSTOSC_EXT4X        EQU  H'3F9F'; EXTOSC with 4x PLL, with EXTOSC operating per FEXTOSC bits
_RSTOSC_SOSC         EQU  H'3FBF'; SOSC (31kHz)
_RSTOSC_LFINT        EQU  H'3FCF'; LFINTOSC (31kHz)
_RSTOSC_HFINT1       EQU  H'3FEF'; HFINTOSC (1MHz)
_RSTOSC_EXT1X        EQU  H'3FFF'; EXTOSC operating per FEXTOSC bits

_CLKOUTEN_ON         EQU  H'3EFF'; CLKOUT function is enabled; FOSC/4 clock appears at OSC2
_CLKOUTEN_OFF        EQU  H'3FFF'; CLKOUT function is disabled; I/O or oscillator function on OSC2

_CSWEN_OFF           EQU  H'37FF'; The NOSC and NDIV bits cannot be changed by user software
_CSWEN_ON            EQU  H'3FFF'; Writing to NOSC and NDIV is allowed

_FCMEN_OFF           EQU  H'1FFF'; Fail-Safe Clock Monitor is disabled
_FCMEN_ON            EQU  H'3FFF'; Fail-Safe Clock Monitor is enabled

;----- CONFIG2 Options --------------------------------------------------
_MCLRE_OFF           EQU  H'3FFE'; MCLR/VPP pin function is digital input; MCLR internally disabled; Weak pull-up under control of port pin's WPU control bit.
_MCLRE_ON            EQU  H'3FFF'; MCLR/VPP pin function is MCLR; Weak pull-up enabled

_PWRTE_ON            EQU  H'3FFD'; PWRT enabled
_PWRTE_OFF           EQU  H'3FFF'; PWRT disabled

_WDTE_OFF            EQU  H'3FF3'; WDT disabled; SWDTEN is ignored
_WDTE_SWDTEN         EQU  H'3FF7'; WDT controlled by the SWDTEN bit in the WDTCON register
_WDTE_SLEEP          EQU  H'3FFB'; WDT enabled while running and disabled in SLEEP/IDLE; SWDTEN is ignored
_WDTE_ON             EQU  H'3FFF'; WDT enabled, SWDTEN is ignored

_LPBOREN_ON          EQU  H'3FDF'; ULPBOR enabled
_LPBOREN_OFF         EQU  H'3FFF'; ULPBOR disabled

_BOREN_OFF           EQU  H'3F3F'; Brown-out Reset disabled
_BOREN_SBOREN        EQU  H'3F7F'; Brown-out Reset enabled according to SBOREN
_BOREN_SLEEP         EQU  H'3FBF'; Brown-out Reset enabled while running, disabled in Sleep; SBOREN is ignored
_BOREN_ON            EQU  H'3FFF'; Brown-out Reset enabled, SBOREN bit ignored

_BORV_HIGH           EQU  H'3DFF'; Brown-out voltage (Vbor) set to 2.7V
_BORV_LOW            EQU  H'3FFF'; Brown-out voltage (Vbor) set to 2.45V

_PPS1WAY_OFF         EQU  H'37FF'; The PPSLOCK bit can be set and cleared repeatedly (subject to the unlock sequence)
_PPS1WAY_ON          EQU  H'3FFF'; The PPSLOCK bit can be cleared and set only once; PPS registers remain locked after one clear/set cycle

_STVREN_OFF          EQU  H'2FFF'; Stack Overflow or Underflow will not cause a Reset
_STVREN_ON           EQU  H'3FFF'; Stack Overflow or Underflow will cause a Reset

_DEBUG_ON            EQU  H'1FFF'; Background debugger enabled
_DEBUG_OFF           EQU  H'3FFF'; Background debugger disabled

;----- CONFIG3 Options --------------------------------------------------
_WRT_ALL             EQU  H'3FFC'; 0000h to 1FFFh write protected, no addresses may be modified
_WRT_HALF            EQU  H'3FFD'; 0000h to 03FFh write-protected, 0400h to 1FFFh may be modified
_WRT_BOOT            EQU  H'3FFE'; 0000h to 01FFh write-protected, 0200h to 1FFFh may be modified
_WRT_OFF             EQU  H'3FFF'; Write protection off

_LVP_OFF             EQU  H'1FFF'; High Voltage on MCLR/VPP must be used for programming.
_LVP_ON              EQU  H'3FFF'; Low Voltage programming enabled. MCLR/VPP pin function is MCLR. MCLRE configuration bit is ignored.

;----- CONFIG4 Options --------------------------------------------------
_CP_ON               EQU  H'3FFE'; User NVM code protection enabled
_CP_OFF              EQU  H'3FFF'; User NVM code protection disabled

_CPD_ON              EQU  H'3FFD'; Data NVM code protection enabled
_CPD_OFF             EQU  H'3FFF'; Data NVM code protection disabled

;----- DEVID Equates --------------------------------------------------
_DEVID1          EQU  H'8006'

;----- IDLOC Equates --------------------------------------------------
_IDLOC0          EQU  H'8000'
_IDLOC1          EQU  H'8001'
_IDLOC2          EQU  H'8002'
_IDLOC3          EQU  H'8003'

        LIST
